[{"id":9,"title":"The Faces of Disability","excerpt":"<p>In our lifetime, we will all be affected by a disability; whether it be personally; or of a loved one, friend, or family member. A disability may include an impairment, activity limitation, or participation restriction.<\/p>\n","content":"<p>In our lifetime, we will all be affected by a disability; whether it be personally; or of a loved one, friend, or family member. A disability may include an impairment, activity limitation, or participation restriction. It may be congenital; or occurring later due to sickness or accident;  or infirmities which come with ageing.  In essence, each of us is differently-abled— physically, or emotionally. Specific challenges may affect us or others: and each one is to be addressed individually:<\/p>\n<p><strong>Physical disabilities:<\/strong> Disability that affects movement. This includes missing or reduced control of limbs, manual dexterity and disability in coordination with different organs of the body.<br \/>\nExample: Post-Polio Residual Palsy<\/p>\n<p><strong>Sensory impairment:<\/strong> Limited or complete absence of hearing and vision. This is caused through genetics, premature birth, infections or diseases. Example: Colour Blindness<\/p>\n<p><strong>Intellectual impairment:<\/strong> Originates before age 18. Characterized by significant limitations in intellectual functioning and adaptive behaviour as expressed in conceptual, social and practical adaptive skills.<br \/>\nExample: Down syndrome<\/p>\n<p><strong>Developmental disabilities:<\/strong> Condition present at birth. This involves a life-long physical, cognitive or behavioural impairment.<br \/>\nExample: Cerebral Palsy, Autism Spectrum Disorder<\/p>\n<p><strong>Acquired impairments:<\/strong> Developed during the person’s lifetime – that is, a disability that is the result of an accident or illness rather than a disability the person was born with.<br \/>\nExample: Spinal Cord Injury<\/p>\n<p><strong>Mental illness:<\/strong> Emotional and behavioural disorders causing lack of interpersonal skills and poor ability to function in life.<br \/>\nExample: Depression<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","image":14},{"id":18,"title":"The Hard Facts of Disability","excerpt":"<p>Facts and statistics about disability in India<\/p>\n","content":"<p>According to numbers of the Census 2011, India’s population of people with disabilities increased by 22.4 % in 11 years. When we include families of persons with disabilities, or the elderly who are disabled; <em>the percentage of Indians affected by disabilities could be as high as 65%!<\/em><\/p>\n<p>Rural areas have a higher prevalence of PwD than urban areas; however, the <em>growth rate <\/em>of disabled population is more in urban areas—and among females. Persons with mobility impairment are the largest group; then hearing impaired, visually impaired, and intellectually disabled.<\/p>\n<p>Poverty is both a cause and consequence of disability. <em>Cause<\/em>: job loss, reduced earnings, barriers to education and skills development. <em>Consequence<\/em>: limited access to health care and preventive services, living in an environment that adversely affects health and longevity.<\/p>\n<p><a href=\"http:\/\/www.who.int\/mediacentre\/factsheets\/fs352\/en\/#.V-kTBRrNRr0.email\">http:\/\/www.who.int\/mediacentre\/factsheets\/fs352\/en\/#.V-kTBRrNRr0.email<\/a><\/p>\n","image":11},{"id":21,"title":"The Need","excerpt":"<p>The needs for basic entitlements, access to government schemes and services, education, vocational training and meaningful employment largely remains unmet.<\/p>\n","content":"<p style=\"margin: 0cm 0cm 18.0pt 0cm;\"><span style=\"font-family: 'Helvetica',sans-serif; color: #333333;\">The needs for basic entitlements, access to government schemes and services, education, vocational training and meaningful employment largely remains unmet. This is due to poor implementation of “The Persons with Disabilities (Equal Opportunities, Protection of Rights and Full Participation) Act, 1995 by the Department of Empowerment of Persons With Disabilities.<\/span><\/p>\n<p style=\"font-variant-ligatures: normal; font-variant-caps: normal; orphans: 2; text-align: start; widows: 2; -webkit-text-stroke-width: 0px; word-spacing: 0px; margin: 0cm 0cm 18.0pt 0cm;\"><span style=\"font-family: 'Helvetica',sans-serif; color: #333333;\">The UN Convention of the Rights of Persons with Disabilities (CRPD) has been ratified by India—but is still pending in Parliament. If—and when—it is ratified, it would take the place of the 1995 Act with far-reaching benefits. Also, there is the national Trust Act which caters specifically for intellectual disabilities and multiple disabilities; however, these schemes and benefits are implemented only in urban areas. Needs for people with disabilities in rural areas, still, remain unmet.<\/span><\/p>\n<p style=\"font-variant-ligatures: normal; font-variant-caps: normal; orphans: 2; text-align: start; widows: 2; -webkit-text-stroke-width: 0px; word-spacing: 0px; margin: 0cm 0cm 18.0pt 0cm;\"><span style=\"font-family: 'Helvetica',sans-serif; color: #333333;\">Consequently, it is imperative for NGO’s, churches, and individuals to assist in advocacy, serving as a “bridge” to help them achieve basic rights and access various entitlements. Women, especially who are most often the caretakers, face significant social exclusion and discrimination on multiple levels. They need accurate information, empowering experiences and mutual encouragement of self-help groups, which enable them to become effective self-advocates.<\/span><\/p>\n","image":22}]
