[{"id":5,"title":"Introduction","excerpt":"<p>In your setting, how possible is it to offer guidance to people with disabilities?<\/p>\n","content":"<p><span style=\"color: #000000;\">Our structure is <em>practical<\/em>, beginning with a look at awareness. You have the scope of awareness, of disabilities, in your own midst:<\/span><\/p>\n<ul>\n<li><span style=\"color: #000000;\">Which individuals personally have a disability, and where are they?<\/span><\/li>\n<li><span style=\"color: #000000;\">What families are affected by the disability of a sibling, a child or parent?<\/span><\/li>\n<li><span style=\"color: #000000;\">What is the nature of the disability: physical or mental?<\/span><\/li>\n<li><span style=\"color: #000000;\">Are there resources in the community to assist the person who has the disability—and how can that person be integrated into the community?<\/span><\/li>\n<\/ul>\n<p><span style=\"color: #000000;\">In your setting, how possible is it to offer spiritual guidance to the disabled person, and how would you assess the level of understanding he or she might have?  Specifically:<\/span><\/p>\n<ul>\n<li><span style=\"color: #000000;\">What is your understanding of a person affected by a disability in relation to God?<\/span><\/li>\n<li><span style=\"color: #000000;\">What do you think is God’s view of people with disabilities?<\/span><\/li>\n<li><span style=\"color: #000000;\">Are your staff or team adequately equipped to minister to people with physical or intellectual disabilities—or to their families?<\/span><\/li>\n<\/ul>\n<p><span style=\"color: #000000;\">Having a difficult time answering these questions? Then join us!<\/span><\/p>\n","image":460},{"id":268,"title":"The Challenge","excerpt":"<p>This module helps us understand the hard facts of people with disabilities in India<\/p>\n","content":"","image":451},{"id":25,"title":"The Biblical Response to Disability","excerpt":"<p>The Biblical and faith understanding—or theology of disability, is what the Bible says about disability in the overall purposes of God in our world. <\/p>\n","content":"<p>The Biblical and faith understanding—or <em>theology of disability,<\/em> is what the Bible says about disability in the overall purposes of God in our world. God made us all <em>equally created in His image in our inward spirit<\/em>. Our God is just! He loves us unconditionally, and because of the death of His only son Jesus Christ, the Holy Spirit works to conform us more closely to His likeness.<\/p>\n<p>By observing Jesus carefully, we see His deep compassion toward people with disabilities: healing the blind, the lepers and those considered to be “the least.” Jesus came that we might have life in all its fullness—and all be present in his full house when he comes again at his final, glorious feast. (Luke 14) As God is restoring His created kingdom of shalom, we are His agents as part of His body to set people free from “otherness.”<\/p>\n<p><a href=\"https:\/\/www.joniandfriends.org\/media\/uploads\/downloads\/CreatedImageGod09.pdf\">https:\/\/www.joniandfriends.org\/media\/uploads\/downloads\/CreatedImageGod09.pdf<\/a><\/p>\n<p><strong>Two missing links to be inserted<\/strong><\/p>\n<p>Luke 4:18; Luke 24:36-39; Luke 14; Micah 4:6-8<\/p>\n<p>&nbsp;<\/p>\n","image":27},{"id":30,"title":"Inclusive Church Ministries","excerpt":"<p>Disabilities are prevalent in the world, but rare in churches. Over 750 million people worldwide are affected by disability; only 10% have access to the Gospel.<\/p>\n","content":"<p>Disabilities are prevalent in the world, but rare in churches. Over 750 million people worldwide are affected by disability; only 10% have access to the Gospel. The Lausanne Committee for World Evangelization have stated that people with a disability represent the <em>world’s largest unreached people’s group<\/em>.<\/p>\n<p>The lack of <em>active inclusion<\/em> in the Body of Christ is equivalent to <em>passive exclusion.<\/em> Jesus himself set the tone, reaching out to people with disabilities. When included, people with disabilities bless and grow the church; enabling the church to proclaim the Biblical message that ALL are created in the image of God. Inclusion illustrates that the church is indeed the Family of God, encouraging all people to become a part of the family. Receiving communion with the Body; providing music, dance or song; taking up collection; eating together—and even participation in church governance; all are important facets of inclusion for a person with a disability.<\/p>\n<p>“Emotional inclusion” becomes reality when the physical aspects of accessibility are addressed. The construction of a ramp allows entry, while removal of barriers enables the person to enter the church space. Liturgy should be made practical for those who are physically-disabled, hearing impaired, or emotionally challenged.  Services should be designed to accommodate wheelchairs, or people with specific disabilities. And Sunday School can be a wonderful open door for those who are disabled, to enter the Kingdom of heaven!<\/p>\n","image":31},{"id":33,"title":"Etiquette in Responding to a Person with a Disability","excerpt":"<p>Watch your Language: Verbal and Body language belie your attitude toward people with disabilities<\/p>\n","content":"<p>Watch your Language: Verbal and Body language belie your attitude toward people with disabilities:<\/p>\n<p><strong><em>Verbal<\/em><\/strong>: Instead of “lame”, <em>physically challenged<\/em>; not “crippled”, but <em>affected by disability<\/em>; not “dumb”, but <em>hearing impaired<\/em>; not “blind”, but <em>visually impaired<\/em>. Most important: not “a disabled person”, but <em>“a person with a disability&#8221;<\/em> (person is primary, disability secondary!) –  or acceptable terminology might be <em>physically challenged<\/em> or <em>differently abled<\/em>. Address a person with a disability by his\/her name.<\/p>\n<p>In informal writing, “PwD” can be used as short hand for people with disabilities.<\/p>\n<p><strong><em>Body<\/em><\/strong>:  Remember the “3 P’s: Be Personal, Be Positive, and Be Precise.”  Smile, be casual and relational. If in a family, acknowledge all members. Be sensitive, and teach your children to be respectful toward those with a disability.<\/p>\n<p>For wheelchair users: Speak to them at eye-level, give room for their wheelchair; ask if you can push them or encourage their independence. For one visually impaired: Face the person and attract their attention first; then speak at normal pitch using hand and body gestures.<\/p>\n<p>For one with autism: Since the spectrum covers a broad range of characteristics, find that comfort level and make effort to stay there. Honor their need for routine and predictability. Be aware that touch may be intimidating for them.<\/p>\n<p><a href=\"http:\/\/network.crcna.org\/disability-concerns\/appropriate-language-about-people-disabilities#.V-j-12k0aAg.emailhttps:\/\/www.jcu.edu.au\/accessability-services\/working-with-students-with-a-disability\/appropriatelanguage\">http:\/\/network.crcna.org\/disability-concerns\/appropriate-language-about-people-disabilities#.V-j-12k0aAg.emailhttps:\/\/www.jcu.edu.au\/accessability-services\/working-with-students-with-a-disability\/appropriatelanguage<\/a><\/p>\n<p><a href=\"https:\/\/cme.mc.vanderbilt.edu\/sites\/default\/files\/TennesseeDisabilityPathfinder-DisabilityEtiquettePeopleFirstLanguage(12811).pdf\">https:\/\/cme.mc.vanderbilt.edu\/sites\/default\/files\/TennesseeDisabilityPathfinder-DisabilityEtiquettePeopleFirstLanguage(12811).pdf<\/a><\/p>\n","image":34},{"id":37,"title":"Personal Development and Family Life","excerpt":"<p>The well-being of the entire family must be supported—not just the disability, it impacts the parents, siblings, extended family—even the community.<\/p>\n","content":"<p>The well-being of the entire family must be supported—not just the disability, it impacts the parents, siblings, extended family—even the community.<\/p>\n<p>Parenting of a child with a disability can be a daunting challenge, as sexuality, relationships, and independence all have to be addressed. Sexuality as part of the human experience needs to be understood and supported in the context of friendships, socially accepted boundaries and long-term relationships. For the child with a disability, it is extremely important to educate the child about sexual abuse—even within the family unit.<\/p>\n<p>For a caretaker of an adult with acquired disabilities (age induced, accident, etc.), it is necessary to assist them in character development and independence. Often, the caretaker is the “forgotten one” as attention is primarily given to the person with a disability. Emotional and physical support is needed for the caretaker to effectively continue his\/her service.<\/p>\n<p>Support groups for families living with disability can provide necessary encouragement and information; as well as social activities with a focus on siblings of the person with a disability. Parents, professionals, youth workers and volunteers need to foster personal independence in daily living; increased levels of decision-making, and life choices in children with disabilities. This includes opportunities to discuss sexuality appropriately with the child, enhancing well-rounded growth into adulthood with fulfilling personal relationships<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/m.raisingchildren.net.au\/articles\/disabilities_routines.html\/context\/1290\">http:\/\/m.raisingchildren.net.au\/articles\/disabilities_routines.html\/context\/1290<\/a><\/p>\n<p><a href=\"http:\/\/www.family-friendly-fun.com\/family-life\/disability.htm#.V-kFJLgUP0o.email\">http:\/\/www.family-friendly-fun.com\/family-life\/disability.htm#.V-kFJLgUP0o.email <\/a><\/p>\n","image":38},{"id":48,"title":"Health Care and Rehabilitation","excerpt":"<p>Three levels of healthcare are relevant to disability: health promotion and prevention; community or primary health care; and medical care in a hospital.<\/p>\n","content":"<p>Three levels of healthcare are relevant to disability:  health promotion and prevention; community or primary health care; and medical care in a hospital.  It is important to have a simple guide of healthcare and rehabilitation services which are available in the community for people who have disabilities. Rehabilitation services can reduce the impact of the impairment on individuals; and healthcare facilities provide analysis and care and of a particular disability.<\/p>\n<p>A successful way of providing rehabilitation and inclusive development services to a person with a disability is Community-based Rehabilitation (CBR), a model developed by the World Health Organization.<\/p>\n<p>Practical assistance is important in the home as well; and follow up of recommended rehabilitative exercises can be provided by friends and family. Providing transport for hospital appointments to family members or the disabled person is also a welcomed service.<\/p>\n","image":49},{"id":52,"title":"Education","excerpt":"<p>Special emphasis should be directed toward girls with a disability, as often their gender identity within the family and community is already an impediment to formal education.<\/p>\n","content":"<p>Special emphasis should be directed toward girls with a disability, as often their gender identity within the family and community is already an impediment to formal education.<\/p>\n<p>There may be schools in the immediate area which provide special education, providing a welcome to students who are differently abled. Rehabilitation therapies, including family counseling, may be available in some schools or organizations. Ministries or NGO’s may be a good place to direct students who face the societal stigma of a disability.<\/p>\n<p>Formal education may not be possible, due to the level of disability of a person. Here, <em>local volunteers<\/em> can make a big difference, simply being present and providing companionship. Volunteers can provide the warmth of acceptance, creative ways to interact with the individual, or appropriate movement\/sports activities for the person. Providing transportation for a person attending an event is a wonderful service; or donating toys, school materials or even meals.<\/p>\n<p>The field of Special Education is a satisfying career, and may include rehabilitation and further social or medical training. Graduates, who have a natural gift of mercy and service might be encouraged to join the field of special education.<\/p>\n","image":238},{"id":57,"title":"Livelihood","excerpt":"<p>A sense of self-sufficiency and the ability to enhance family income are important to people who are affected by disabilities.<\/p>\n","content":"<p>A sense of <em>self-sufficiency<\/em> and <em>the ability to enhance<\/em> <em>family income<\/em> are important to people who are affected by disabilities. Fortunately state and government laws are changing—and now a quota of 3% of corporate employees must come from the disability sector. Though encouraging, the need is still for people to be educated or trained sufficiently in order to obtain those jobs.<\/p>\n<p>Vocational training is especially needed for girls and women who often cannot get jobs where education is required. Referrals of people with disabilities to small-scale industries and service industries can be extended; even preparation for job interviews is needed—and can be done by caring individuals in the church.<\/p>\n<p>The Government programs created for people with disabilities should be tapped. Often, the person with a disability, and family, are not aware of these services and resources; like free bus pass, free train pass, monthly rations, medical funds, stipends, and even housing.  Caring individuals can become the “bridge” between the person who needs assistance, and the many forms of assistance available to people with disabilities.<\/p>\n<p>It is imperative that we discourage these who beg to seek work. It is often easy to judge these hapless individuals without taking the time to seek alternatives for their livelihood. With our concerted help, many can make a positive contribution to society. It may be that we employee them ourselves, or help create “petty shops” for them and buy the items they sell!<\/p>\n","image":58},{"id":60,"title":"Empowerment","excerpt":"<p>The Bible has much to say about justice, which becomes a foundation for extending rights and undergirding advocacy for people affected by disability.<\/p>\n","content":"<p>The Bible has much to say about justice, which becomes a foundation for extending rights and undergirding advocacy for people affected by disability.  Individuals like Moses and Esther were successful advocates and became saviors of their people.<\/p>\n<p>People with disabilities are often the best spokespeople on issues that affect their lives—and must be a part of the advocacy for their own. They can be effective in accessing government schemes and services; and powerful “bridges” between the government and the disability community.<\/p>\n<p>Special emphasis should be placed on the empowerment of <em>women<\/em> who are disabled, as they often feel doubly discriminated. They are usually the caretaker of a child, or a family member who is disabled—and must be fully supported.<\/p>\n","image":61},{"id":63,"title":"Leisure","excerpt":"<p>Emotional needs of people with disabilities can be addressed through leisure activities; among them sports, music, drama and art. Such activities help develop individual gifts and means of personal expression. <\/p>\n","content":"<p>Emotional needs of people with disabilities can be addressed through leisure activities; among them sports, music, drama and art. Such activities help develop individual gifts and means of personal expression. Also, leisure provides greater opportunities for social action in family, church and community; and building good relationships.<\/p>\n<p>Leisure activities are a non-threatening means of outreach for both the person who has a disability and those who come alongside that person. <em>Individual<\/em> development may be enhanced through an activity like guitar lessons or art instruction; and more <em>social interaction<\/em> through the range of sports like cricket; or a picnic, participation in a choir or talent show. Inclusion can be fun—and confidence-building for the person with a disability can be enhanced through leisure activities.<\/p>\n<p>Team and individual sports are a fast-growing area for people with disabilities. Wheelchair rugby or basketball are some of the team sports; while the individual can play tennis or badminton; swim, ride horseback, weightlift or compete in chess or gaming competitions. With the assistance of the Paralympics program in the country, more people affected by disabilities can become champions in the field of sports!<\/p>\n","image":64},{"id":3,"title":"Call to Action","excerpt":"<p>You become the conduit for this Good News for our friends, families; and entire communities who are affected by disabilities!<\/p>\n","content":"<p style=\"padding: 20px; color: #64a71a;\"><span style=\"color: #000000;\"><em>Grounded in the Word, disability ministry is not an elective, but a mandate instituted by Jesus through His own life. All people were created in His image—and have a special place as the children of God, “joint heirs of salvation.” He became the “broken one” with whom those who suffer from disabilities can relate. <\/em><\/span><\/p>\n<table style=\"color: white; width: 322px; border: 0px solid #64a71a; background-color: #64a71a; border-radius: 4px; height: 166px;\">\n<tbody>\n<tr>\n<td style=\"vertical-align: middle; width: 70%; border: 0px solid #64a71a;\" align=\"center\"><span style=\"font-size: xx-large;\"> Mpower = <\/span><\/td>\n<td style=\"vertical-align: middle; padding-left: 2px; border: 0px solid #64a71a;\">\n<table style=\"border: 0px solid #64a71a;\">\n<tbody style=\"border: 0px solid #64a71a;\">\n<tr style=\"border: 0px solid #64a71a;\">\n<td style=\"border: 0px solid #64a71a;\">Acceptance<\/td>\n<\/tr>\n<tr style=\"border: 0px solid #64a71a;\">\n<td style=\"border: 0px solid #64a71a;\">Accessibility<\/td>\n<\/tr>\n<tr style=\"border: 0px solid #64a71a;\">\n<td style=\"border: 0px solid #64a71a;\">Advocacy<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","image":454}]
